VladisM/mcu_libs/src/driver_mcu/src/gpio_afr/stm32f4/afr_STM32F413xx.h
//PC8
#define AFR_PC8_DFSDM2_CKIN3    AFR_7
#define AFR_PC8_EVENTOUT        AFR_15
#define AFR_PC8_QUADSPI_BK1_IO2 AFR_9
#define AFR_PC8_SDIO_D0         AFR_12
#define AFR_PC8_TIM3_CH3        AFR_2
#define AFR_PC8_TIM8_CH3        AFR_3
#define AFR_PC8_USART6_CK       AFR_8

//PC9
#define AFR_PC9_DFSDM2_DATIN3   AFR_7
#define AFR_PC9_EVENTOUT        AFR_15
#define AFR_PC9_I2C3_SDA        AFR_4
#define AFR_PC9_I2S_CKIN        AFR_5
#define AFR_PC9_QUADSPI_BK1_IO0 AFR_9
#define AFR_PC9_RCC_MCO_2       AFR_0
#define AFR_PC9_SDIO_D1         AFR_12
#define AFR_PC9_TIM3_CH4        AFR_2
#define AFR_PC9_TIM8_CH4        AFR_3

//PD0
#define AFR_PD0_CAN1_RX      AFR_9
#define AFR_PD0_DFSDM2_CKIN6 AFR_3
#define AFR_PD0_EVENTOUT     AFR_15
#define AFR_PD0_FSMC_D2      AFR_12
#define AFR_PD0_FSMC_DA2     AFR_12
#define AFR_PD0_UART4_RX     AFR_11

//PD1
#define AFR_PD1_CAN1_TX       AFR_9
#define AFR_PD1_DFSDM2_DATIN6 AFR_3
#define AFR_PD1_EVENTOUT      AFR_15
#define AFR_PD1_FSMC_D3       AFR_12
#define AFR_PD1_FSMC_DA3      AFR_12
#define AFR_PD1_UART4_TX      AFR_11

//PD10
#define AFR_PD10_EVENTOUT  AFR_15
#define AFR_PD10_FSMC_D15  AFR_12
#define AFR_PD10_FSMC_DA15 AFR_12
#define AFR_PD10_UART4_TX  AFR_8
#define AFR_PD10_USART3_CK AFR_7

//PD11
#define AFR_PD11_DFSDM2_DATIN2   AFR_3
#define AFR_PD11_EVENTOUT        AFR_15
#define AFR_PD11_FMPI2C1_SMBA    AFR_4
#define AFR_PD11_FSMC_A16        AFR_12
#define AFR_PD11_QUADSPI_BK1_IO0 AFR_9
#define AFR_PD11_USART3_CTS      AFR_7

//PD12
#define AFR_PD12_DFSDM2_CKIN2    AFR_3
#define AFR_PD12_EVENTOUT        AFR_15
#define AFR_PD12_FMPI2C1_SCL     AFR_4
#define AFR_PD12_FSMC_A17        AFR_12
#define AFR_PD12_QUADSPI_BK1_IO1 AFR_9
#define AFR_PD12_TIM4_CH1        AFR_2
#define AFR_PD12_USART3_RTS      AFR_7

//PD13
#define AFR_PD13_EVENTOUT        AFR_15
#define AFR_PD13_FMPI2C1_SDA     AFR_4
#define AFR_PD13_FSMC_A18        AFR_12
#define AFR_PD13_QUADSPI_BK1_IO3 AFR_9
#define AFR_PD13_TIM4_CH2        AFR_2

//PD14
#define AFR_PD14_DFSDM2_CKIN0 AFR_10
#define AFR_PD14_EVENTOUT     AFR_15
#define AFR_PD14_FMPI2C1_SCL  AFR_4
#define AFR_PD14_FSMC_D0      AFR_12
#define AFR_PD14_FSMC_DA0     AFR_12
#define AFR_PD14_TIM4_CH3     AFR_2
#define AFR_PD14_UART9_RX     AFR_11

//PD15
#define AFR_PD15_DFSDM2_DATIN0 AFR_10
#define AFR_PD15_EVENTOUT      AFR_15
#define AFR_PD15_FMPI2C1_SDA   AFR_4
#define AFR_PD15_FSMC_D1       AFR_12
#define AFR_PD15_FSMC_DA1      AFR_12
#define AFR_PD15_TIM4_CH4      AFR_2
#define AFR_PD15_UART9_TX      AFR_11

//PD2
#define AFR_PD2_DFSDM2_CKOUT AFR_3
#define AFR_PD2_EVENTOUT     AFR_15
#define AFR_PD2_FSMC_NWE     AFR_10
#define AFR_PD2_SDIO_CMD     AFR_12
#define AFR_PD2_TIM3_ETR     AFR_2
#define AFR_PD2_UART5_RX     AFR_8

//PD3
#define AFR_PD3_DFSDM1_DATIN0 AFR_6
#define AFR_PD3_EVENTOUT      AFR_15
#define AFR_PD3_FSMC_CLK      AFR_12
#define AFR_PD3_I2S2_CK       AFR_5
#define AFR_PD3_QUADSPI_CLK   AFR_9
#define AFR_PD3_SPI2_SCK      AFR_5
#define AFR_PD3_SYS_TRACED1   AFR_0
#define AFR_PD3_USART2_CTS    AFR_7

//PD4
#define AFR_PD4_DFSDM1_CKIN0 AFR_6
#define AFR_PD4_EVENTOUT     AFR_15
#define AFR_PD4_FSMC_NOE     AFR_12
#define AFR_PD4_USART2_RTS   AFR_7

//PD5
#define AFR_PD5_DFSDM2_CKOUT AFR_3
#define AFR_PD5_EVENTOUT     AFR_15
#define AFR_PD5_FSMC_NWE     AFR_12
#define AFR_PD5_USART2_TX    AFR_7

//PD6
#define AFR_PD6_DFSDM1_DATIN1 AFR_6
#define AFR_PD6_EVENTOUT      AFR_15
#define AFR_PD6_FSMC_NWAIT    AFR_12
#define AFR_PD6_I2S3_SD       AFR_5
#define AFR_PD6_SPI3_MOSI     AFR_5
#define AFR_PD6_USART2_RX     AFR_7

//PD7
#define AFR_PD7_DFSDM1_CKIN1 AFR_6
#define AFR_PD7_EVENTOUT     AFR_15
#define AFR_PD7_FSMC_NE1     AFR_12
#define AFR_PD7_USART2_CK    AFR_7

//PD8
#define AFR_PD8_EVENTOUT  AFR_15
#define AFR_PD8_FSMC_D13  AFR_12
#define AFR_PD8_FSMC_DA13 AFR_12
#define AFR_PD8_USART3_TX AFR_7

//PD9
#define AFR_PD9_EVENTOUT  AFR_15
#define AFR_PD9_FSMC_D14  AFR_12
#define AFR_PD9_FSMC_DA14 AFR_12
#define AFR_PD9_USART3_RX AFR_7

//PE0
#define AFR_PE0_DFSDM2_CKIN4 AFR_3
#define AFR_PE0_EVENTOUT     AFR_15
#define AFR_PE0_FSMC_NBL0    AFR_12
#define AFR_PE0_TIM4_ETR     AFR_2
#define AFR_PE0_UART8_RX     AFR_8

//PE1
#define AFR_PE1_DFSDM2_DATIN4 AFR_3
#define AFR_PE1_EVENTOUT      AFR_15
#define AFR_PE1_FSMC_NBL1     AFR_12
#define AFR_PE1_UART8_TX      AFR_8

//PE10
#define AFR_PE10_DFSDM2_DATIN0   AFR_3
#define AFR_PE10_EVENTOUT        AFR_15
#define AFR_PE10_FSMC_D7         AFR_12
#define AFR_PE10_FSMC_DA7        AFR_12
#define AFR_PE10_QUADSPI_BK2_IO3 AFR_10
#define AFR_PE10_TIM1_CH2N       AFR_1

//PE11
#define AFR_PE11_DFSDM2_CKIN0 AFR_3
#define AFR_PE11_EVENTOUT     AFR_15
#define AFR_PE11_FSMC_D8      AFR_12
#define AFR_PE11_FSMC_DA8     AFR_12
#define AFR_PE11_I2S4_WS      AFR_5
#define AFR_PE11_I2S5_WS      AFR_6
#define AFR_PE11_SPI4_NSS     AFR_5
#define AFR_PE11_SPI5_NSS     AFR_6
#define AFR_PE11_TIM1_CH2     AFR_1

//PE12
#define AFR_PE12_DFSDM2_DATIN7 AFR_3
#define AFR_PE12_EVENTOUT      AFR_15
#define AFR_PE12_FSMC_D9       AFR_12
#define AFR_PE12_FSMC_DA9      AFR_12
#define AFR_PE12_I2S4_CK       AFR_5
#define AFR_PE12_I2S5_CK       AFR_6
#define AFR_PE12_SPI4_SCK      AFR_5
#define AFR_PE12_SPI5_SCK      AFR_6
#define AFR_PE12_TIM1_CH3N     AFR_1

//PE13
#define AFR_PE13_DFSDM2_CKIN7 AFR_3
#define AFR_PE13_EVENTOUT     AFR_15
#define AFR_PE13_FSMC_D10     AFR_12
#define AFR_PE13_FSMC_DA10    AFR_12
#define AFR_PE13_SPI4_MISO    AFR_5
#define AFR_PE13_SPI5_MISO    AFR_6
#define AFR_PE13_TIM1_CH3     AFR_1

//PE14
#define AFR_PE14_DFSDM2_DATIN1 AFR_10
#define AFR_PE14_EVENTOUT      AFR_15
#define AFR_PE14_FSMC_D11      AFR_12
#define AFR_PE14_FSMC_DA11     AFR_12
#define AFR_PE14_I2S4_SD       AFR_5
#define AFR_PE14_I2S5_SD       AFR_6
#define AFR_PE14_SPI4_MOSI     AFR_5
#define AFR_PE14_SPI5_MOSI     AFR_6
#define AFR_PE14_TIM1_CH4      AFR_1

//PE15
#define AFR_PE15_DFSDM2_CKIN1 AFR_10
#define AFR_PE15_EVENTOUT     AFR_15
#define AFR_PE15_FSMC_D12     AFR_12
#define AFR_PE15_FSMC_DA12    AFR_12
#define AFR_PE15_TIM1_BKIN    AFR_1

